
{
    "hey_im":"Salut, moi c'est",
    "software_developer": "Développeur logiciel",
    "about_me_text": "Je suis un développeur basé à Nice, spécialisé dans le développement Front-End. J'adore créer des choses.",
    "experience_card": {
        "monist_title": "Développeur Front-end",
        "breachquest_title": "Développeur Front-end",
        "BANGK_title": "Développeur Full-stack",
    "monist_desc": "Avec Monist Studio, j'ai travaillé sur la conception de sites web et       développé des sites performants et responsifs pour des clients.",
    "breachquest_desc": "Avec Breachquest, j'ai collaboré avec une équipe talentueuse de     développeurs sur Priori, un système de notification de cyberattaques de pointe.",
    "BANGK_desc": "Avec BANGK, j'ai eu l'opportunité de créer diverses applications pour une plateforme fintech, notamment une application native, un site web et un tableau de bord interne."
    },
    "tech_stack_card": {
        "storybook": "J'utilise Storybook pour tester et développer des composants indépendamment de l'application, ce qui garantit des composants bien construits, sans aucun bug.",
        "jest": "Jest est ma méthode de test préférée, il est rapide et simple à utiliser, avec de nombreuses fonctionnalités intégrées.",
        "rtl": "Avec Jest, React Testing Library assure une couverture élevée de mes projets, des plus petits composants aux fonctionnalités complètes.",
        "figma": "J'utilise Figma pour collaborer sur des designs et créer des interfaces utilisateur précises et bien pensées.",
        "github": "J'utilise GitHub pour collaborer avec d'autres développeurs dans des environnements personnels et professionnels.",
        "tanstack":"tanstack",
        "expo": "Expo est une excellente solution pour le développement mobile.",
        "zod": "Zod est mon validateur de types préféré, garantissant une sécurité optimale des types.",
        "javascript": "JavaScript",
        "typescript": "TypeScript",
        "html": "HTML",
        "css": "CSS",
        "react": "React",
        "react_native": "React Native",
        "next": "Next.js",
        "tailwind": "Tailwind",
        "panda_css": "Panda CSS"
    }
}

  